project/app/controllers/posts_controller.rb

def create
		@post = current_user.posts.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("review", "longitude", "latitude", "user_id", "created_at", "updated_at", "photos") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show_location
   @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @post = Post.all
---
SELECT "posts".* FROM "posts"