project/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "jesonleejunzhen@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.where(email: params[:session][:email].downcase).first

INSERT INTO "authentications" ("uid", "token", "provider", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "authentications".* FROM "authentications" WHERE "authentications"."provider" = ? AND "authentications"."uid" = ? LIMIT ?  [["provider", "facebook"], ["uid", "10208889538754440"], ["LIMIT", 1]]
UPDATE "authentications" SET "token" = ?, "updated_at" = ? WHERE "authentications"."id" = ?
INSERT INTO "users" ("name", "birthday", "gender", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create_from_omniauth
      auth_hash = request.env["omniauth.auth"]
      authentication = Authentication.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"]) ||  Authentication.create_with_omniauth(auth_hash)

      # if: previously already logged in with OAuth
      if authentication.user
        user = authentication.user
        authentication.update_token(auth_hash)
        @next ="/users/#{user.id}/edit"
        @notice = "Signed in!"
      # else: user logs in with OAuth for the first time
      else
        user = User.create_with_auth_and_hash(authentication, auth_hash)