project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "birthday", "gender", "country", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	@user = User.new(user_params)
    #byebug
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "users" SET "birthday" = ?, "country" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["birthday", "1997-11-28"], ["country", "MY"], ["updated_at", "2018-03-01 10:48:39.196742"], ["id", 7]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(birthday: user_params[:birthday], country: user_params[:country])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def forget
  	@user = User.find(params[:id])